# Простые типы данных

# Задание 1
# поправьте код, чтобы выводилось число
# на 10 больше, чем введённое
# например, пользователь ввел 10
# программа вывела 20

v = input('Введите число от 1 до 10: ')
print(int(v)+10)


# Задание 2
# поправьте код, чтобы выводилась строка
# Привет, ИМЯ! Как дела?

name = input('Введите ваше имя: ')
print(f'Привет, {name}! Как дела?')


# Задание 3
# Выведите на экран при помощи print() результат работы:
# float('1')
# int('2.5')
# bool(1)
# bool('')
# bool(0)

print(float('1'))
print(int('2.5'))
print(bool(1))
print(bool(''))
print(bool(0))
